---
type: MullionTypeSet
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# MullionTypeSet

`Autodesk.Revit.DB.MullionTypeSet` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | MullionTypeSet | — | `public MullionTypeSet ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( MullionType item )` |
| Method | Erase | — | `public virtual int Erase ( MullionType item )` |
| Method | ForwardIterator | — | `public virtual MullionTypeSetIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( MullionType item )` |
| Method | ReverseIterator | — | `public virtual MullionTypeSetIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |